InformationRegisters/СчетаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетаУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПередачи</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСПоПриобретеннымЦенностям</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСУплаченногоНаТаможне</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаЗабалансовый</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПередачиЗабалансовый</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовОтРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасходовОтРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_бк_СчетРасчетов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_бк_СчетАвансов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаАкцизаПоРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаАкцизаПоИмпорту</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидСчетаФактурыВыставленного.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидСчетаФактурыВыставленного</Name>
			<Comment>Вид выставленного счета-фактуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРеализацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСуммовуюРазницу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитентаНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяСправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйНаАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочнаяСправка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/бит_бк_ОбщийМодуль/Ext/Module.bsl
Процедура ПриСозданииФормыУслуги(Элементы, Объект) Экспорт
	
	НовыйЭлемент = Элементы.Добавить("бит_бк_ЯвляетсяГруппой", Тип("ПолеФормы"), Элементы.ГруппаШапка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_бк_ЯвляетсяГруппойУслуг";
	НовыйЭлемент.Заголовок = "Является группой услуг";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_бк_ЯвляетсяУслугойПриИзменении");
	
	НоваяСтраница = Элементы.Добавить("СтрСоставУслуг",Тип("ГруппаФормы"), Элементы.Панель);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;                                          
	НоваяСтраница.Заголовок = "Состав услуги";
	НоваяСтраница.Видимость = Объект.бит_бк_ЯвляетсяГруппойУслуг;
	
	НоваяТаблица = Элементы.Добавить("ТаблицаСоставУслуг",Тип("ТаблицаФормы"), Элементы.СтрСоставУслуг);
	НоваяТаблица.ПутьКДанным = "Объект.бит_бк_СоставУслуги";
	НоваяТаблица.РастягиватьПоГоризонтали = Ложь;
	НоваяТаблица.Ширина = 100;
	НоваяТаблица.КоманднаяПанель.РазрешитьИзменениеСостава = Истина;
	
	НовыйЭлемент = Элементы.Добавить("бит_бк_Услуга", Тип("ПолеФормы"), Элементы.ТаблицаСоставУслуг);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Услуга";
	НовыйЭлемент.ПутьКДанным = "Объект.бит_бк_СоставУслуги.Услуга";
	
	НовыйЭлемент = Элементы.Добавить("бит_бк_НеПривязанаКРасчетуПоДням", Тип("ПолеФормы"), Элементы.ГруппаШапка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_бк_НеПривязанаКРасчетуПоДням";
	
КонецПроцедуры

Процедура НачислениеУслугОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Услуга", Источник.Услуга);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Источник.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УПЖКХ_НачисленияОбороты.Услуга,
	|	УПЖКХ_НачисленияОбороты.СуммаНачисленияОборот
	|ИЗ
	|	Справочник.КВП_Услуги.бит_бк_СоставУслуги КАК КВП_Услугибит_бк_СоставУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.УПЖКХ_Начисления.Обороты(, &КонецПериода, , ) КАК УПЖКХ_НачисленияОбороты
	|		ПО КВП_Услугибит_бк_СоставУслуги.Услуга = УПЖКХ_НачисленияОбороты.Услуга
	|ГДЕ
	|	КВП_Услугибит_бк_СоставУслуги.Ссылка = &Услуга
	|	И КВП_Услугибит_бк_СоставУслуги.Ссылка.бит_бк_ЯвляетсяГруппойУслуг = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("За период " + Формат(Источник.Дата, "ДФ='ММММ гггг'") + " было начисление по составу услуги: " + Выборка.Услуга);
		Отказ = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаДляОтраженияНачиленийВРегУчете() Экспорт
	
	//+БИ 24062019
	// в запросе убрал лишнее соединение
	//-БИ 24062019
	
	Текст =
	"ВЫБРАТЬ
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Номенклатура КАК Номенклатура,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ЭтоЛьгота КАК ЭтоЛьгота,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ЭтоПени КАК ЭтоПени,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Тариф КАК Тариф,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
	|	СУММА(КВП_НачислениеДляОтраженияВРеглУчетеОстатки.СуммаОстаток) КАК СуммаОтражения,
	|	СУММА(КВП_НачислениеДляОтраженияВРеглУчетеОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.КВП_НачислениеДляОтраженияВРеглУчете.Остатки(
	|			&ДатаСреза,
	|			Организация = &Организация
	|				И &ТекстДопУсловия) КАК КВП_НачислениеДляОтраженияВРеглУчетеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КВП_Услуги.бит_бк_СоставУслуги КАК КВП_Услугибит_бк_СоставУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК УслугиБух
	|			ПО КВП_Услугибит_бк_СоставУслуги.Ссылка.Услуга = УслугиБух.Ссылка
	|		ПО КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Номенклатура = КВП_Услугибит_бк_СоставУслуги.Услуга.Услуга
	// Клес +
	|	&СоединениеОтборПоОбъектуОстатки
	// Клес -
	|
	|СГРУППИРОВАТЬ ПО
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорКонтрагента,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ВариантПоставкиУслуг,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ЭтоПени,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорПоставщикаУслуг,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ЭтоЛьгота,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.НоменклатурнаяГруппа,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорКонтрагента.Владелец,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Номенклатура,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Тариф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияДокумента.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ДвиженияДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА КВП_Услуги.бит_бк_ЯвляетсяГруппойУслуг
	|			ТОГДА ДвиженияДокумента.Номенклатура
	|		ИНАЧЕ ЕСТЬNULL(УслугиБух.Ссылка, ДвиженияДокумента.Номенклатура)
	|	КОНЕЦ КАК Номенклатура,
	|	ДвиженияДокумента.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ДвиженияДокумента.ЭтоЛьгота КАК ЭтоЛьгота,
	|	ДвиженияДокумента.ЭтоПени КАК ЭтоПени,
	|	ДвиженияДокумента.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
	|	ДвиженияДокумента.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
	|	СУММА(ДвиженияДокумента.Сумма) КАК СуммаОтражения,
	|	СУММА(ДвиженияДокумента.Количество) КАК Количество,
	|	ДвиженияДокумента.Тариф КАК Тариф
	|ПОМЕСТИТЬ ДвиженияДокумента
	|ИЗ
	|	РегистрНакопления.КВП_НачислениеДляОтраженияВРеглУчете КАК ДвиженияДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КВП_Услуги КАК КВП_Услуги
	|		ПО ДвиженияДокумента.Номенклатура = КВП_Услуги.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КВП_Услуги.бит_бк_СоставУслуги КАК КВП_Услугибит_бк_СоставУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК УслугиБух
	|			ПО КВП_Услугибит_бк_СоставУслуги.Ссылка.Услуга = УслугиБух.Ссылка
	|		ПО ДвиженияДокумента.Номенклатура = КВП_Услугибит_бк_СоставУслуги.Услуга.Услуга
	//Клес +
	|	&СоединениеОтборПоОбъектуДвижения
	// Клес -
	|ГДЕ
	|	ДвиженияДокумента.Регистратор = &ДокСсылка
	|	И &ТекстДопУсловия
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияДокумента.ДоговорКонтрагента.Владелец,
	|	ДвиженияДокумента.ДоговорКонтрагента,
	|	ДвиженияДокумента.НоменклатурнаяГруппа,
	|	ДвиженияДокумента.ЭтоЛьгота,
	|	ДвиженияДокумента.ЭтоПени,
	|	ДвиженияДокумента.ВариантПоставкиУслуг,
	|	ДвиженияДокумента.ДоговорПоставщикаУслуг,
	|	ДвиженияДокумента.Тариф,
	|	ВЫБОР
	|		КОГДА КВП_Услуги.бит_бк_ЯвляетсяГруппойУслуг
	|			ТОГДА ДвиженияДокумента.Номенклатура
	|		ИНАЧЕ ЕСТЬNULL(УслугиБух.Ссылка, ДвиженияДокумента.Номенклатура)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Контрагент КАК Контрагент,
	|	Остатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	Остатки.ЭтоЛьгота КАК ЭтоЛьгота,
	|	Остатки.ЭтоПени КАК ЭтоПени,
	|	Остатки.Тариф КАК Тариф,
	|	Остатки.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
	|	Остатки.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
	|	Остатки.СуммаОтражения КАК СуммаОтражения,
	|	Остатки.Количество КАК Количество,
	|	СчетаУчетаНоменклатуры.бит_бк_СчетРасчетов КАК СчетУчетаРасчетов,
	|	СчетаУчетаНоменклатуры.бит_бк_СчетАвансов КАК СчетУчетаАвансов,
	|	СчетаУчетаНоменклатуры.бит_бк_СчетРасчетов КАК бит_бк_СчетРасчетов,
	|	СчетаУчетаНоменклатуры.бит_бк_СчетАвансов КАК бит_бк_СчетАвансов
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	Остатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
	|		ПО Остатки.Номенклатура = СчетаУчетаНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияДокумента.Контрагент КАК Контрагент,
	|	ДвиженияДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДвиженияДокумента.Номенклатура КАК Номенклатура,
	|	ДвиженияДокумента.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ДвиженияДокумента.ЭтоЛьгота КАК ЭтоЛьгота,
	|	ДвиженияДокумента.ЭтоПени КАК ЭтоПени,
	|	ДвиженияДокумента.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
	|	ДвиженияДокумента.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
	|	ДвиженияДокумента.СуммаОтражения КАК СуммаОтражения,
	|	ДвиженияДокумента.Количество КАК Количество,
	|	ДвиженияДокумента.Тариф КАК Тариф,
	|	СчетаУчетаНоменклатуры.бит_бк_СчетРасчетов КАК СчетУчетаРасчетов,
	|	СчетаУчетаНоменклатуры.бит_бк_СчетАвансов КАК СчетУчетаАвансов,
	|	СчетаУчетаНоменклатуры.бит_бк_СчетРасчетов КАК бит_бк_СчетРасчетов,
	|	СчетаУчетаНоменклатуры.бит_бк_СчетАвансов КАК бит_бк_СчетАвансов
	|ПОМЕСТИТЬ ТаблицаДвиженийДокумента
	|ИЗ
	|	ДвиженияДокумента КАК ДвиженияДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
	|		ПО ДвиженияДокумента.Номенклатура = СчетаУчетаНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаОстатков.Контрагент, ТаблицаДвиженийДокумента.Контрагент) КАК Контрагент,
	|	ЕСТЬNULL(ТаблицаОстатков.ДоговорКонтрагента, ТаблицаДвиженийДокумента.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ТаблицаОстатков.Номенклатура, ТаблицаДвиженийДокумента.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТаблицаОстатков.НоменклатурнаяГруппа, ТаблицаДвиженийДокумента.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
	|	ЕСТЬNULL(ТаблицаОстатков.ЭтоЛьгота, ТаблицаДвиженийДокумента.ЭтоЛьгота) КАК ЭтоЛьгота,
	|	ЕСТЬNULL(ТаблицаОстатков.ЭтоПени, ТаблицаДвиженийДокумента.ЭтоПени) КАК ЭтоПени,
	|	ЕСТЬNULL(ТаблицаОстатков.ВариантПоставкиУслуг, ТаблицаДвиженийДокумента.ВариантПоставкиУслуг) КАК ВариантПоставкиУслуг,
	|	ЕСТЬNULL(ТаблицаОстатков.ДоговорПоставщикаУслуг, ТаблицаДвиженийДокумента.ДоговорПоставщикаУслуг) КАК ДоговорПоставщикаУслуг,
	|	ВЫБОР
	|		КОГДА &ВедетсяРаздельныйУчетКапРемонта
	|				И ЕСТЬNULL(ТаблицаОстатков.Номенклатура, ТаблицаДвиженийДокумента.Номенклатура) В (&СписокНоменклатурыУслугКапРемонта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКапРемонт,
	|	ЕСТЬNULL(ТаблицаОстатков.СуммаОтражения, 0) + ЕСТЬNULL(ТаблицаДвиженийДокумента.СуммаОтражения, 0) КАК СуммаОтражения,
	|	ЕСТЬNULL(ТаблицаОстатков.СчетУчетаРасчетов, ТаблицаДвиженийДокумента.СчетУчетаРасчетов) КАК СчетУчетаРасчетов,
	|	ЕСТЬNULL(ТаблицаОстатков.СчетУчетаАвансов, ТаблицаДвиженийДокумента.СчетУчетаАвансов) КАК СчетУчетаАвансов,
	|	ЕСТЬNULL(ТаблицаОстатков.бит_бк_СчетРасчетов, ТаблицаДвиженийДокумента.бит_бк_СчетРасчетов) КАК бит_бк_СчетРасчетов,
	|	ЕСТЬNULL(ТаблицаОстатков.бит_бк_СчетАвансов, ТаблицаДвиженийДокумента.бит_бк_СчетАвансов) КАК бит_бк_СчетАвансов,
	|	ЕСТЬNULL(ТаблицаОстатков.Тариф, ТаблицаДвиженийДокумента.Тариф) КАК Тариф,
	|	ЕСТЬNULL(ТаблицаОстатков.Количество, 0) + ЕСТЬNULL(ТаблицаДвиженийДокумента.Количество, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА &ОтражатьОтрицательныеНачисленияИНачисленияБезОбъемовОтдельно
	|			И (ЕСТЬNULL(ТаблицаОстатков.СуммаОтражения, 0) + ЕСТЬNULL(ТаблицаДвиженийДокумента.СуммаОтражения, 0) < 0
	|				ИЛИ ЕСТЬNULL(ТаблицаОстатков.Количество, 0) + ЕСТЬNULL(ТаблицаДвиженийДокумента.Количество, 0) = 0)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоРеализация
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаДвиженийДокумента КАК ТаблицаДвиженийДокумента
	|		ПО (ТаблицаДвиженийДокумента.Контрагент = ТаблицаОстатков.Контрагент)
	|			И (ТаблицаДвиженийДокумента.ДоговорКонтрагента = ТаблицаОстатков.ДоговорКонтрагента)
	|			И (ТаблицаДвиженийДокумента.Номенклатура = ТаблицаОстатков.Номенклатура)
	|			И (ТаблицаДвиженийДокумента.НоменклатурнаяГруппа = ТаблицаОстатков.НоменклатурнаяГруппа)
	|			И (ТаблицаДвиженийДокумента.ЭтоЛьгота = ТаблицаОстатков.ЭтоЛьгота)
	|			И (ТаблицаДвиженийДокумента.ЭтоПени = ТаблицаОстатков.ЭтоПени)
	|			И (ТаблицаДвиженийДокумента.ВариантПоставкиУслуг = ТаблицаОстатков.ВариантПоставкиУслуг)
	|			И (ТаблицаДвиженийДокумента.ДоговорПоставщикаУслуг = ТаблицаОстатков.ДоговорПоставщикаУслуг)
	|ГДЕ
	|	&УсловиеОтрицательныхСумм";
	
	Возврат Текст;
	
КонецФункции

Функция ЯвляетсяГруппойУслуг(Услуга) Экспорт
	
	Если Не ЗначениеЗаполнено(Услуга) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КВП_Услуги.Ссылка
	|ИЗ
	|	Справочник.КВП_Услуги КАК КВП_Услуги
	|ГДЕ
	|	КВП_Услуги.Услуга = &Услуга
	|	И КВП_Услуги.бит_бк_ЯвляетсяГруппойУслуг = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Процедура СформироватьДвиженияПоСоставуУслуги(Услуга, Договор, СтрокаРеквизитов, НаборДвижений) Экспорт
	
	Если Не ЗначениеЗаполнено(Услуга) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Услуга);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КВП_Услугибит_бк_СоставУслуги.Услуга.Услуга КАК УслугаБух
	|ПОМЕСТИТЬ ВТ_СоставУслуги
	|ИЗ
	|	Справочник.КВП_Услуги.бит_бк_СоставУслуги КАК КВП_Услугибит_бк_СоставУслуги
	|ГДЕ
	|	КВП_Услугибит_бк_СоставУслуги.Ссылка.Услуга = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Организация,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорКонтрагента,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Номенклатура,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.НоменклатурнаяГруппа,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ЭтоЛьгота,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ЭтоПени,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ВариантПоставкиУслуг,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорПоставщикаУслуг,
	|	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.СуммаОстаток
	|ИЗ
	|	ВТ_СоставУслуги КАК ВТ_СоставУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.КВП_НачислениеДляОтраженияВРеглУчете.Остатки(, ДоговорКонтрагента = &ДоговорКонтрагента) КАК КВП_НачислениеДляОтраженияВРеглУчетеОстатки
	|		ПО ВТ_СоставУслуги.УслугаБух = КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = НаборДвижений.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период      = СтрокаРеквизитов.Период;
		Движение.Организация = СтрокаРеквизитов.Организация;
		
		Движение.Номенклатура           = Выборка.Номенклатура;
		Движение.НоменклатурнаяГруппа   = Выборка.НоменклатурнаяГруппа;
		Движение.ДоговорКонтрагента     = Выборка.ДоговорКонтрагента;
		Движение.ВариантПоставкиУслуг   = Выборка.ВариантПоставкиУслуг;
		Движение.ДоговорПоставщикаУслуг = Выборка.ДоговорПоставщикаУслуг;
		
		Движение.ЭтоЛьгота              = Выборка.ЭтоЛьгота;
		Движение.ЭтоПени                = Выборка.ЭтоПени;
		Движение.Сумма                  = Выборка.СуммаОстаток;
		
	КонецЦикла
	
КонецПроцедуры

Процедура ПередЗаписьюРТиУ(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка ИЛИ Отказ Тогда
		Возврат;
	КонецЕСли;
	
	Если Не Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Комментарий = "Документ сгенерирован автоматически для отражения  начислений." Тогда
		
		Для Каждого Строка Из Источник.Услуги Цикл
			
			ДопСодержание = " согласно Договору " + Источник.ДоговорКонтрагента.Номер + " от " +
			Формат(Источник.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " за " + Формат(Источник.Дата, "ДФ='ММММ гггг'");
			Строка.Содержание = Строка.Содержание + ДопСодержание;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииФормыЗаписиСчетаРасчетовНоменклатуры(Элементы) Экспорт
	
	НоваяГруппа = Элементы.Добавить("бит_бк_ГруппаРасчетовСконтрагентом", Тип("ГруппаФормы"), Элементы.ГруппаСчетаЛеваяКолонка);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НоваяГруппа.Заголовок = "Счета расчетов по услуге";
	
	НовыйЭлемент = Элементы.Добавить("бит_бк_СчетРасчетов", Тип("ПолеФормы"), Элементы.бит_бк_ГруппаРасчетовСконтрагентом);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Счет расчетов";
	НовыйЭлемент.ПутьКДанным = "Запись.бит_бк_СчетРасчетов";
	
	НовыйЭлемент = Элементы.Добавить("бит_бк_СчетАвансов", Тип("ПолеФормы"), Элементы.бит_бк_ГруппаРасчетовСконтрагентом);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Счет авансов";
	НовыйЭлемент.ПутьКДанным = "Запись.бит_бк_СчетАвансов";
	
КонецПроцедуры

Процедура ПриСозданииФормыВводПоказанийСчетчика(ЭтаФорма) Экспорт
	
	Кмд = ЭтаФорма.Команды.Добавить("бит_бк_СохранитьВExcel");
    Кмд.Действие = "бит_бк_СохранитьВExcel";
    Кмд.Заголовок = "Выгрузить в Excel";
	Кмд.Картинка = БиблиотекаКартинок.ФорматExcel2007;
	Кмд.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
    НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_бк_СохранитьВExcel", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ДеревоПоказанийКоманднаяПанель);
    НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
    НовыйЭлемент.ИмяКоманды = "бит_бк_СохранитьВExcel";
	
КонецПроцедуры

Функция СохранитьДанныеТЧВExcel(Источник) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	
	Макет = Документы.УПЖКХ_ВводПоказанийСчетчика.ПолучитьМакет("бит_бк_ВводПоказанийСчетчика");
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
	
	//Выводим шапку
	ОбластьМакетаШапка.Параметры.Услуга = Источник.Услуга;
	ОбластьМакетаШапка.Параметры.Период = Формат(ТекущаяДата(),"ДФ='ММММ гггг'");	
	ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
	
	// + NAI Becar Конюшок С.Н. от 08.06.2017 15:34 
	ТЗ = Источник.Главная.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Объект,
	|	ТЗ.НомерСтроки,
	|	ТЗ.Счетчик,
	|	ТЗ.ДневноеПоказание,
	|	ТЗ.НочноеПоказание,
	|	ТЗ.ПиковоеПоказание
	|ПОМЕСТИТЬ ТЧДокумента
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧДокумента.Объект,
	|	ТЧДокумента.Счетчик,
	|	ТЧДокумента.ДневноеПоказание КАК ДневноеПрошлое,
	|	ТЧДокумента.НочноеПоказание КАК НочноеПрошлое,
	|	ТЧДокумента.ПиковоеПоказание,
	|	КВП_ЛицевыеСчетаСрезПоследних.Объект КАК Помещение,
	|	ТЧДокумента.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТЧДокумента КАК ТЧДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КВП_ЛицевыеСчета.СрезПоследних(&Период, ) КАК КВП_ЛицевыеСчетаСрезПоследних
	|		ПО ((ВЫРАЗИТЬ(ТЧДокумента.Объект КАК Справочник.КВП_ЛицевыеСчета)) = КВП_ЛицевыеСчетаСрезПоследних.ЛицевойСчет)
	|			И (КВП_ЛицевыеСчетаСрезПоследних.Действует)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Период", КонецДня(Источник.Дата));
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Пока РЗ.Следующий() Цикл
		
		ОбластьМакетаСтрока.Параметры.Заполнить(РЗ);
		ОбластьМакетаСтрока.Параметры.Собственник 	= УПЖКХ_ОбщегоНазначенияСервер.ПолучитьОтветственногоСобственникаЛицевогоСчета(
														РЗ.Объект, КонецДня(ТекущаяДата()));

		ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
	
	КонецЦикла; 
	
	////Выводим ТЧ
	//Для Каждого Строка Из Источник.Главная Цикл
	//	
	//	ОбластьМакетаСтрока.Параметры.Объект 		= Строка.Объект;
	//	ОбластьМакетаСтрока.Параметры.Собственник 	= УПЖКХ_ОбщегоНазначенияСервер.ПолучитьОтветственногоСобственникаЛицевогоСчета(
	//													Строка.Объект, КонецДня(ТекущаяДата()));
	//	ОбластьМакетаСтрока.Параметры.Счетчик 		= Строка.Счетчик;
	//	ОбластьМакетаСтрока.Параметры.Дневное 		= Строка.ДневноеПоказание;
	//	ОбластьМакетаСтрока.Параметры.Ночное 		= Строка.НочноеПоказание;
	//	ОбластьМакетаСтрока.Параметры.Пиковое 		= Строка.ПиковоеПоказание;
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
	//	
	//КонецЦикла;
	// - NAI Becar Конюшок С.Н. 
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура РаспределитьНачисленияСУчетомДней(Источник) Экспорт
	
	ТЗ = Источник.УслугиПоПоказаниямПУ.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Источник.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Источник.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.ЛицевойСчет
	// клес +
	|	,ТЗ.Услуга
	// клес -
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	// клес +
	|	ВТ.Услуга,
	// клес -
	|	бит_бк_ДанныеПоДнямСрезПоследних.ЛицевойСчет,
	|	бит_бк_ДанныеПоДнямСрезПоследних.КоличествоДней
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_бк_ДанныеПоДням.СрезПоследних(
	|				&КонецПериода,
	|				ЛицевойСчет В
	|						(ВЫБРАТЬ
	|							ВТ.ЛицевойСчет
	|						ИЗ
	|							ВТ КАК ВТ)
	|					И (Период МЕЖДУ &НачалоПериода И &КонецПериода)) КАК бит_бк_ДанныеПоДнямСрезПоследних
	|		ПО ВТ.ЛицевойСчет = бит_бк_ДанныеПоДнямСрезПоследних.ЛицевойСчет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		// Клес +
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
		Отбор.Вставить("Услуга", Выборка.Услуга);
		Поиск = Источник.УслугиПоПоказаниямПУ.НайтиСтроки(Отбор);
		Если Поиск.Количество() = 1 Тогда НайденнаяСтрока = Поиск[0]; КонецЕсли;
		//НайденнаяСтрока = Источник.УслугиПоПоказаниямПУ.Найти(Выборка.ЛицевойСчет);
		// Клес -
		//исключим строки по которым выполнен индивидуальный расчет
		Если ЗначениеЗаполнено(НайденнаяСтрока) И Не ЗначениеЗаполнено(НайденнаяСтрока.Сумма) Тогда
			
			ТекущаяСумма = НайденнаяСтрока.СуммаРаспределения;
			НайденнаяСтрока.СуммаРаспределения = ТекущаяСумма/День(КонецМесяца(Источник.Дата)) * Выборка.КоличествоДней;
			Сообщить("По " + Выборка.ЛицевойСчет + " по услуге " + Выборка.Услуга + " за " + Выборка.КоличествоДней + " дней рассчитано: " + НайденнаяСтрока.СуммаРаспределения);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьНачисленияСУчетомДней(Источник) Экспорт
	
	ТЗ = Источник.Услуги.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Источник.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Источник.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.ЛицевыеСчета КАК ЛицевойСчет
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_бк_ДанныеПоДнямСрезПоследних.ЛицевойСчет,
	|	бит_бк_ДанныеПоДнямСрезПоследних.КоличествоДней
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_бк_ДанныеПоДням.СрезПоследних(
	|				&КонецПериода,
	|				ЛицевойСчет В
	|						(ВЫБРАТЬ
	|							ВТ.ЛицевойСчет
	|						ИЗ
	|							ВТ КАК ВТ)
	|					И (Период МЕЖДУ &НачалоПериода И &КонецПериода)) КАК бит_бк_ДанныеПоДнямСрезПоследних
	|		ПО ВТ.ЛицевойСчет = бит_бк_ДанныеПоДнямСрезПоследних.ЛицевойСчет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НайденнаяСтрока = Источник.Услуги.Найти(Выборка.ЛицевойСчет);
		
		Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
			
			ТекущаяСумма = НайденнаяСтрока.Начислено;
			НайденнаяСтрока.Начислено = ТекущаяСумма/День(КонецМесяца(Источник.Дата)) * Выборка.КоличествоДней;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РаспределитьПропорционально(Знач ИсхСумма, МассивКоэф, Знач Точность = 2, Здание, Дата) Экспорт
	
	Если МассивКоэф.Количество() = 0 Или ИсхСумма = 0 Или ИсхСумма = Null Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ТипЗнч(Здание) = Тип("СправочникСсылка.КВП_Здания") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В качестве объекта необходимо указать здание!");
		Возврат Неопределено;
	КонецЕсли;
	
	Если Здание.ПлощадьЗданияОбщая = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена общая площадь здания!");
		Возврат Неопределено;
	КонецЕсли;
	
	МассивСумм = Новый Массив(МассивКоэф.Количество());
	
	мСуммаКРаспределению = ИсхСумма;
	// Клес + изменение по задаче от Писарьковой Юны "Теперь по законодательству мы должны делить не на общую S, а на жилую (арендопригодную)."
	Если Дата >= Дата("20220401") Тогда
		мЗнаменательРаспределения = Здание.ПлощадьЗданияЖилыхНежилыхПомещений;
	Иначе
		мЗнаменательРаспределения = Здание.ПлощадьЗданияОбщая;
	КонецЕсли;
	
	Для К = 0 По МассивКоэф.Количество() - 1 Цикл
		МассивСумм[К] = Окр(мСуммаКРаспределению * МассивКоэф[К] / ?(мЗнаменательРаспределения = 0, 1, мЗнаменательРаспределения), Точность, 1);
	КонецЦикла;
	
	Возврат МассивСумм;
	
КонецФункции

Процедура ЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("бит_бк_ОбменБухгалтерия30ТСЖ30", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("бит_бк_ОбменБухгалтерия30ТСЖ30", Источник, Отказ);
	
КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	//Если (Источник.Организация.Код = "000000143") или (Источник.Организация.Код = "000010189") Тогда
	Если (Источник.Организация.Код = "000000143") или (Источник.Организация.Код = "000014377") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
			или ТипЗнч(Источник) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") 
			или ТипЗнч(Источник) = Тип("ДокументСсылка.СчетФактураВыданный") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураВыданный") 
			Тогда
			
			Если ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				или ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
				Тогда
					Префикс = "";
					УстановитьПрефикс(Источник, Префикс, Истина, Истина);
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	РеализацияТоваровУслуг.Ссылка,
					               |	ПОДСТРОКА(РеализацияТоваровУслуг.Номер, 6, 8) КАК Номер
					               |ИЗ
					               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					               |ГДЕ
					               |	ПОДСТРОКА(РеализацияТоваровУслуг.Номер, 1, 5) = &Префикс

					               |	И МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &месяц
								   |	И ГОД(РеализацияТоваровУслуг.Дата) = &год
					               |	И РеализацияТоваровУслуг.Номер ПОДОБНО &Символ
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	РеализацияТоваровУслуг.Номер УБЫВ";
								   
					Запрос.УстановитьПараметр("Префикс",Префикс); 
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",Год(Источник.Дата));
					Запрос.УстановитьПараметр("Символ","%/%");
					
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Стр.НомерЧисло = Число(Стр.Номер);
					КонецЦикла;	
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					
					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "00001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
 
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 5 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли; 				    				   
					
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
				или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") 
				Тогда
				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ОтчетКомитентуОПродажах.Ссылка,
					               |	ПОДСТРОКА(ОтчетКомитентуОПродажах.Номер, 6, 3) КАК Номер
					               |ИЗ
					               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
					               |ГДЕ
					               |	ПОДСТРОКА(ОтчетКомитентуОПродажах.Номер, 1, 5) = &Префикс

					               |	И МЕСЯЦ(ОтчетКомитентуОПродажах.Дата) = &месяц
					               |	И ГОД(ОтчетКомитентуОПродажах.Дата) = &год
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Номер УБЫВ";
								   
					Префикс = Лев(Префикс,5); 
					Запрос.УстановитьПараметр("Префикс",Префикс); 
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",год(Источник.Дата));
					
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Если Стр.Номер <> "" Тогда
							Стр.НомерЧисло = Число(Стр.Номер);
						КонецЕсли;	
					КонецЦикла;	
					
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					 
					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
 
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 3 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли; 				   
					
			Иначе
				// счет-фактура
				
				Если Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАванс и
					Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента и
					Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
					
					УстановитьПрефикс(Источник, Префикс, Истина, Истина);
				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	СчетФактураВыданный.Ссылка,
								   |	ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 8) КАК Номер
					               |ИЗ
					               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
					               |ГДЕ
								   |	ПОДСТРОКА(СчетФактураВыданный.Номер, 1, 5) = &Префикс

					               |	И МЕСЯЦ(СчетФактураВыданный.Дата) = &месяц
								   |	И ГОД(СчетФактураВыданный.Дата) = &год
					               |	И НЕ СчетФактураВыданный.ВидСчетаФактуры В (&ВидСчетаФактуры)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Номер УБЫВ";
								   
					Префикс = Лев(Префикс,5); 
					Запрос.УстановитьПараметр("Префикс",Префикс);
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",год(Источник.Дата));
					ВидСчетаФактуры = Новый СписокЗначений;
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАванс);
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку);
					Запрос.УстановитьПараметр("ВидСчетаФактуры",ВидСчетаФактуры);
				
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Если Стр.Номер <> "" Тогда
							Стр.НомерЧисло = Число(Стр.Номер);
						КонецЕсли;	
					КонецЦикла;	
					
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ"); 

					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "00001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	

						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 5 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли;
				Иначе
					СтандартнаяОбработка = Истина;
					УстановитьПрефикс(Источник, Лев(Префикс,5), Истина, Истина);
				КонецЕсли;	
					
			КонецЕсли;	
		
			Источник.Номер = НовыйНомер;
		КонецЕсли;	
				
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)
	
	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";
	
	Если УстановитьПрефиксИнформационнойБазы Тогда
		
		ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);
		
		ДополнитьСтрокуНулямиСлева(ПрефиксИнформационнойБазы, 2);
	КонецЕсли;
	
	Если УстановитьПрефиксОрганизации Тогда
		
		Если РеквизитОрганизацияДоступен(Источник) Тогда
			
			ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаОрганизации(
				Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации);
			// Если задана пустая ссылка на организацию.
			Если ПрефиксОрганизации = Ложь Тогда
				
				ПрефиксОрганизации = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 2);
	КонецЕсли;
	
	ШаблонПрефикса = "[ОР][ИБ]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);
	
	Префикс = ШаблонПрефикса; //-са
	
КонецПроцедуры

Процедура ДополнитьСтрокуНулямиСлева(Строка, ДлинаСтроки)
	
	Строка = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка, ДлинаСтроки, "0", "Слева");
	
КонецПроцедуры

Функция РеквизитОрганизацияДоступен(Объект)
	
	// Возвращаемое значение функции.
	Результат = Истина;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Если   (ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
		ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта))
		И МетаданныеОбъекта.Иерархический Тогда
		
		ИмяРеквизитаОрганизация = ИмяРеквизитаОрганизация(МетаданныеОбъекта);
		
		РеквизитОрганизация = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизитаОрганизация);
		
		Если РеквизитОрганизация = Неопределено Тогда
			
			Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизитаОрганизация) Тогда
				
				// Стандартный реквизит всегда доступен и для элемента и для группы.
				Возврат Истина;
				
			КонецЕсли;
			
			СтрокаСообщения = НСтр("ru = 'Для объекта метаданных %1 не определен реквизит с именем %2.'");
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, МетаданныеОбъекта.ПолноеИмя(), ИмяРеквизитаОрганизация);
			ВызватьИсключение СтрокаСообщения;
		КонецЕсли;
			
		Если РеквизитОрганизация.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И Не Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		ИначеЕсли РеквизитОрганизация.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ИмяРеквизитаОрганизация(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		ПолноеИмя = Объект.ПолноеИмя();
	Иначе
		ПолноеИмя = Объект;
	КонецЕсли;
	
	Реквизит = ПрефиксацияОбъектовПовтИсп.ПрефиксообразующиеРеквизиты().Получить(ПолноеИмя);
	
	Если Реквизит <> Неопределено Тогда
		Возврат Реквизит;
	КонецЕсли;
	
	Возврат "Организация";
	
КонецФункции
